[
  {
    "tag": "greeting",
    "patterns": [
      "Hi",
      "Hello",
      "Hey",
      "Good morning",
      "Good afternoon",
      "Good evening",
      "Namaste",
      "Vanakkam",
      "Hello there",
      "Greetings",
      "How are you?",
      "How's it going?",
      "What's up?",
      "Hey there",
      "Hi there",
      "Hello there",
      "Greetings",
      "Good day",
      "Good to see you",
      "How do you do?"
    ],
    "responses": [
      "Hello! How can I help you today?",
      "Hi there! Welcome to our Andhra Pradesh restaurant finder.",
      "Good day! What are you looking for?",
      "Namaste! How can I assist you?",
      "Vanakkam! Ready to find your perfect Andhra meal?",
      "Hello! Let's find you the best Andhra restaurants.",
      "Hi! What kind of food are you craving?",
      "Good morning! Looking for breakfast or lunch?",
      "Good afternoon! Time for some Andhra delicacies?",
      "Good evening! Ready for dinner?",
      "Hey there! What's your food preference?",
      "Hi there! Let's explore Andhra's culinary scene.",
      "Hello there! What brings you here today?",
      "Greetings! How can I help you with your dining experience?",
      "Good day! Let's find the perfect restaurant for you.",
      "Good to see you! What are you looking for today?",
      "How do you do? Welcome to Andhra's food paradise.",
      "Hello! Let's find the best Andhra restaurants for you.",
      "Hi! What kind of Andhra food are you craving?",
      "Good morning! Ready for a delicious Andhra breakfast?"
    ]
  },
  {
    "tag": "restaurant_suggestions",
    "patterns": [
      "Find me a restaurant",
      "I'm looking for a restaurant",
      "Where can I find good food?",
      "Suggest a restaurant",
      "I want to eat out",
      "I'm hungry",
      "I'm craving something",
      "What are some good restaurants here?",
      "I need a restaurant recommendation",
      "Help me find a place to eat",
      "I want to try some Andhra cuisine",
      "Where can I find authentic Andhra food?",
      "What are some popular restaurants in Andhra Pradesh?",
      "Recommend restaurants in Andhra Pradesh",
      "Best Andhra cuisine restaurants"
    ],
    "responses": [
      "Sure, here are some recommendations in Andhra Pradesh:",
      "1. Sri Venkateswara Annapoorna Restaurant, Guntur: Famous for its Andhra-style meals.",
      "2. Boardwalk Restaurant, Visakhapatnam: Stunning views of the Bay of Bengal and seafood specialties.",
      "3. Bezawada Dhaba, Vijayawada: Authentic Andhra flavors in a cozy setting.",
      "4. R One Punjabi Dhaba, Guntur: Known for its vibrant ambiance and rich flavors.",
      "5. Lasya Grand Restaurant, Ongole: Excellent Andhra meals with great service.",
      "6. Aloha Cafe, Vijayawada: Perfect for a relaxed coffee and quick bites.",
      "7. Zero The Resto Cafe, Visakhapatnam: A cozy cafe with great coffee and snacks.",
      "8. Brewbakes Cafe, Guntur: Popular for its bakery items and coffee.",
      "9. Delight Dhaba, Mangalagiri: Known for authentic dhaba-style meals.",
      "10. Beyond Temptations, Ongole: Offers a variety of cuisines with a premium ambiance.",
      "11. Gypsy Resto Cafe, Visakhapatnam: Perfect spot for a modern dining experience.",
      "12. Kumbakonam Premium Coffee, Ongole: Renowned for its South Indian filter coffee.",
      "13. WelcomCafe, Guntur: A fine-dining experience with exceptional service.",
      "14. The Hangout, Guntur: Great for casual dining and small gatherings.",
      "15. Fruitify Cafe, Ongole: A delightful place for fresh fruit juices and quick snacks.",
      "16. STAR Dhaba, Vijayawada: Traditional dhaba experience with local flavors.",
      "17. Kanakadurga Restaurant, Vijayawada: Authentic Andhra vegetarian meals.",
      "18. Urban Tadka, Visakhapatnam: Fusion food with a lively ambiance.",
      "19. Sea Spice by Chef Mandar, Visakhapatnam: A fine dining experience with coastal delicacies.",
      "20. Bismillah Dhaba, Guntur: Delicious biryani and tandoori items.",
      "21. Tycoon Multi-Cuisine Restaurant, Visakhapatnam: A mix of global and Andhra cuisines.",
      "22. Masala Darbar, Vijayawada: Famous for spicy Andhra curries.",
      "23. Annapurna Hotel, Rajahmundry: Iconic for authentic Andhra thalis.",
      "24. Minerva Coffee Shop, Tirupati: Known for South Indian breakfast dishes.",
      "25. Dolphin Hotel, Visakhapatnam: Elegant dining with premium Andhra meals.",
      "26. Paradise Biryani, Vijayawada: Renowned for its authentic Hyderabadi biryani.",
      "27. Kshetra Veg Restaurant, Guntur: Pure vegetarian meals with a traditional touch.",
      "28. V Restaurant, Vijayawada: Popular for its rooftop ambiance and diverse menu.",
      "29. Zodiac Multicuisine, Tirupati: Modern dining with a range of cuisines.",
      "30. The Park Restaurant, Visakhapatnam: Coastal dishes with a luxury experience.",
      "31. BBQ Nation, Vijayawada: Interactive dining with live grills on the table.",
      "32. Southern Spice, Visakhapatnam: Specializes in regional Andhra delicacies.",
      "33. Taj Gateway, Vijayawada: Fine dining with premium Andhra flavors.",
      "34. Akshaya Veg Restaurant, Tirupati: Known for its wholesome South Indian meals.",
      "35. Mekong-Pan Asian Restaurant, Visakhapatnam: Asian fusion with Andhra influence.",
      "36. Reddy's Dhaba, Ongole: Rustic setting with delicious dhaba food.",
      "37. Chaitanya Food Court, Rajahmundry: Affordable dining with a variety of options.",
      "38. Sai Priya Beach Resort, Visakhapatnam: Beachside dining with local seafood.",
      "39. Spicy Venue, Vijayawada: Home-style Andhra meals with authentic spices.",
      "40. Manjeera Restaurant, Kakinada: A go-to spot for traditional Andhra dishes.",
      "41. Blue Basil, Visakhapatnam: Perfect for continental and Indian fusion food.",
      "42. Green Park, Visakhapatnam: Luxurious dining with a focus on local cuisine.",
      "43. Amaravati Spice, Guntur: Known for its spicy Andhra biryanis.",
      "44. Swagruha Foods, Vijayawada: Tiffins and sweets in a homely setting.",
      "45. Udipi Hotel, Tirupati: A classic spot for traditional South Indian meals.",
      "46. Aroma Restaurant, Kurnool: Casual dining with a focus on Andhra dishes.",
      "47. Naidu Gari Kunda Biryani, Nellore: Unique biryani cooked in clay pots.",
      "48. Mayuri Multicuisine, Srikakulam: Family dining with diverse options.",
      "49. Vizag Grand, Visakhapatnam: A premium choice for seafood lovers.",
      "50. Abhiruchi Restaurant, Vijayawada: Affordable and tasty Andhra meals.",
      "Let me know if you'd like more details about any of these!"
    ]
  },
  {
    "tag": "restaurant_details",
    "patterns": [
      "Tell me about this restaurant",
      "What's the address of this restaurant?",
      "What are their phone number?",
      "What are their opening hours?",
      "Do they have a website?",
      "What's the menu like?",
      "Do they have special offers?",
      "Do they have outdoor seating?",
      "Do they have parking?",
      "Is it wheelchair accessible?",
      "What's the atmosphere like?",
      "What kind of music do they play?",
      "Do they have live music?",
      "What's the average price range?",
      "Do they have reviews?",
      "What are people saying about this restaurant?",
      "Can you give me more information about this restaurant?"
    ],
    "responses": [
      "Please provide the restaurant name, and I will fetch the details for you.",
      "Most restaurants offer online menus and reviews on their websites. Let me know the name for specifics.",
      "Many popular restaurants in Andhra Pradesh provide detailed information on platforms like Zomato or Google Maps."
    ]
  }
]
