[
  {
    "tag": "greeting",
    "patterns": [
      "Hi",
      "Hello",
      "Hey",
      "Good morning",
      "Good afternoon",
      "Good evening",
      "Namaste",
      "Vanakkam",
      "Hello there",
      "Greetings",
      "How are you?",
      "How's it going?",
      "What's up?",
      "Hey there",
      "Hi there",
      "Hello there",
      "Greetings",
      "Good day",
      "Good to see you",
      "How do you do?"
    ],
    "responses": [
      "Hello! How can I help you today?",
      "Hi there! Welcome to our Andhra Pradesh restaurant finder.",
      "Good day! What are you looking for?",
      "Namaste! How can I assist you?",
      "Vanakkam! Ready to find your perfect Andhra meal?",
      "Hello! Let's find you the best Andhra restaurants.",
      "Hi! What kind of food are you craving?",
      "Good morning! Looking for breakfast or lunch?",
      "Good afternoon! Time for some Andhra delicacies?",
      "Good evening! Ready for dinner?",
      "Hey there! What's your food preference?",
      "Hi there! Let's explore Andhra's culinary scene.",
      "Hello there! What brings you here today?",
      "Greetings! How can I help you with your dining experience?",
      "Good day! Let's find the perfect restaurant for you.",
      "Good to see you! What are you looking for today?",
      "How do you do? Welcome to Andhra's food paradise.",
      "Hello! Let's find the best Andhra restaurants for you.",
      "Hi! What kind of Andhra food are you craving?",
      "Good morning! Ready for a delicious Andhra breakfast?"
    ]
  },
  {
    "tag": "restaurant_suggestions",
    "patterns": [
      "Find me a restaurant",
      "I'm looking for a restaurant",
      "Where can I find good food?",
      "Suggest a restaurant",
      "I want to eat out",
      "I'm hungry",
      "I'm craving something",
      "What are some good restaurants here?",
      "I need a restaurant recommendation",
      "Help me find a place to eat",
      "I want to try some Andhra cuisine",
      "Where can I find authentic Andhra food?",
      "What are some popular restaurants in Andhra Pradesh?",
      "Recommend restaurants in Andhra Pradesh",
      "Best Andhra cuisine restaurants"
    ],
    "responses": [
      "Sure, here are some recommendations in Andhra Pradesh:",
      "Sri Venkateswara Annapoorna Restaurant, Guntur: Famous for its Andhra-style meals.",
      "Boardwalk Restaurant, Visakhapatnam: Stunning views of the Bay of Bengal and seafood specialties.",
      "Bezawada Dhaba, Vijayawada: Authentic Andhra flavors in a cozy setting.",
      "R One Punjabi Dhaba, Guntur: Known for its vibrant ambiance and rich flavors.",
      "Lasya Grand Restaurant, Ongole: Excellent Andhra meals with great service.",
      "Aloha Cafe, Vijayawada: Perfect for a relaxed coffee and quick bites.",
      "Zero The Resto Cafe, Visakhapatnam: A cozy cafe with great coffee and snacks.",
      "Brewbakes Cafe, Guntur: Popular for its bakery items and coffee.",
      "Delight Dhaba, Mangalagiri: Known for authentic dhaba-style meals.",
      "Beyond Temptations, Ongole: Offers a variety of cuisines with a premium ambiance.",
      "Gypsy Resto Cafe, Visakhapatnam: Perfect spot for a modern dining experience.",
      "Kumbakonam Premium Coffee, Ongole: Renowned for its South Indian filter coffee.",
      "WelcomCafe, Guntur: A fine-dining experience with exceptional service.",
      "The Hangout, Guntur: Great for casual dining and small gatherings.",
      "Fruitify Cafe, Ongole: A delightful place for fresh fruit juices and quick snacks.",
      "STAR Dhaba, Vijayawada: Traditional dhaba experience with local flavors.",
      "Kanakadurga Restaurant, Vijayawada: Authentic Andhra vegetarian meals.",
      "Urban Tadka, Visakhapatnam: Fusion food with a lively ambiance.",
      "Sea Spice by Chef Mandar, Visakhapatnam: A fine dining experience with coastal delicacies.",
      "Bismillah Dhaba, Guntur: Delicious biryani and tandoori items.",
      "Tycoon Multi-Cuisine Restaurant, Visakhapatnam: A mix of global and Andhra cuisines.",
      "Masala Darbar, Vijayawada: Famous for spicy Andhra curries.",
      "Annapurna Hotel, Rajahmundry: Iconic for authentic Andhra thalis.",
      "Minerva Coffee Shop, Tirupati: Known for South Indian breakfast dishes.",
      "Dolphin Hotel, Visakhapatnam: Elegant dining with premium Andhra meals.",
      "Paradise Biryani, Vijayawada: Renowned for its authentic Hyderabadi biryani.",
      "Kshetra Veg Restaurant, Guntur: Pure vegetarian meals with a traditional touch.",
      "V Restaurant, Vijayawada: Popular for its rooftop ambiance and diverse menu.",
      "Zodiac Multicuisine, Tirupati: Modern dining with a range of cuisines.",
      "The Park Restaurant, Visakhapatnam: Coastal dishes with a luxury experience.",
      "BBQ Nation, Vijayawada: Interactive dining with live grills on the table.",
      "Southern Spice, Visakhapatnam: Specializes in regional Andhra delicacies.",
      "Taj Gateway, Vijayawada: Fine dining with premium Andhra flavors.",
      "Akshaya Veg Restaurant, Tirupati: Known for its wholesome South Indian meals.",
      "Mekong-Pan Asian Restaurant, Visakhapatnam: Asian fusion with Andhra influence.",
      "Reddy's Dhaba, Ongole: Rustic setting with delicious dhaba food.",
      "Chaitanya Food Court, Rajahmundry: Affordable dining with a variety of options.",
      "Sai Priya Beach Resort, Visakhapatnam: Beachside dining with local seafood.",
      "Spicy Venue, Vijayawada: Home-style Andhra meals with authentic spices.",
      "Manjeera Restaurant, Kakinada: A go-to spot for traditional Andhra dishes.",
      "Blue Basil, Visakhapatnam: Perfect for continental and Indian fusion food.",
      "Green Park, Visakhapatnam: Luxurious dining with a focus on local cuisine.",
      "Amaravati Spice, Guntur: Known for its spicy Andhra biryanis.",
      "Swagruha Foods, Vijayawada: Tiffins and sweets in a homely setting.",
      "Udipi Hotel, Tirupati: A classic spot for traditional South Indian meals.",
      "Aroma Restaurant, Kurnool: Casual dining with a focus on Andhra dishes.",
      "Naidu Gari Kunda Biryani, Nellore: Unique biryani cooked in clay pots.",
      "Mayuri Multicuisine, Srikakulam: Family dining with diverse options.",
      "Vizag Grand, Visakhapatnam: A premium choice for seafood lovers.",
      "Abhiruchi Restaurant, Vijayawada: Affordable and tasty Andhra meals.",
      "Let me know if you'd like more details about any of these!"
    ]
  },
  {
    "tag": "restaurant_details",
    "patterns": [
      "Tell me about this restaurant",
      "What's the address of this restaurant?",
      "What are their phone number?",
      "What are their opening hours?",
      "Do they have a website?",
      "What's the menu like?",
      "Do they have special offers?",
      "Do they have outdoor seating?",
      "Do they have parking?",
      "Is it wheelchair accessible?",
      "What's the atmosphere like?",
      "What kind of music do they play?",
      "Do they have live music?",
      "What's the average price range?",
      "Do they have reviews?",
      "What are people saying about this restaurant?",
      "Can you give me more information about this restaurant?"
    ],
    "responses": [
      "Please provide the restaurant name, and I will fetch the details for you.",
      "Most restaurants offer online menus and reviews on their websites. Let me know the name for specifics.",
      "Many popular restaurants in Andhra Pradesh provide detailed information on platforms like Zomato or Google Maps."
    ]
  }
  {
    "tag": "budget_friendly",
    "patterns": [
      "Find budget-friendly restaurants",
      "I want cheap eats in Vijayawada",
      "Show me economical places to eat in Visakhapatnam",
      "What are some affordable restaurants in Guntur?",
      "Find budget-friendly restaurants",
      "Suggest cheap eats in Andhra Pradesh",
      "Where can I find affordable restaurants in Vijayawada?",
      "Cheap restaurants in Visakhapatnam",
      "Budget-friendly dining in Guntur",
      "Suggest low-cost meals in Ongole",
      "Affordable restaurants in Kakinada?",
      "Where to eat cheaply in Kadapa?",
      "Economical dining options in Anantapur",
      "What are some budget-friendly restaurants in Rajahmundry?",
      "Show me low-cost food options in Nellore",
      "Are there any affordable restaurants in Eluru?"
    ],
    "responses": [
      "Here are some budget-friendly options:\n1. Bezawada Dhaba, Vijayawada\n2. Chaitanya Food Court, Guntur\n3. Abhiruchi Restaurant, Visakhapatnam",
      "Chaitanya Food Court, Guntur - Affordable meals with great taste.",
      "Bezawada Dhaba, Vijayawada - Authentic and economical Andhra flavors.",
      "Abhiruchi Restaurant, Visakhapatnam - Affordable family dining.",
      "Annapurna Hotel, Rajahmundry - Famous for budget-friendly Andhra thalis.",
      "Sai Krishna Veg Restaurant, Vijayawada - Delicious vegetarian food at a low cost.",
      "Reddy's Dhaba, Ongole - Pocket-friendly dhaba meals with authentic taste.",
      "Mayuri Multicuisine, Srikakulam - Family dining with budget options.",
      "Sri Durga Bhavan Tiffins, Tirupati - Best for affordable breakfast options.",
      "Srikanya Veg Restaurant, Vizianagaram - Popular for its economical South Indian meals.",
      "Vasavi Fast Food, Eluru - Quick and cheap eats.",
      "Biryani Palace, Nellore - Budget-friendly and delicious biryanis.",
      "Durga Mess, Kakinada - Affordable and authentic Andhra meals.",
      "Udupi Cafe, Tirupati - Economical and tasty South Indian cuisine.",
      "Vinayaka Tiffin Center, Vijayawada - Cheap and fresh breakfast options.",
      "Green Chillies Restaurant, Anantapur - Pocket-friendly meals with great flavors.",
      "Bhimas Residency, Tirupati - Budget hotel dining with excellent food.",
      "Vellanki Foods, Vijayawada - Affordable and delicious Andhra sweets and snacks.",
      "Roti Restaurant, Visakhapatnam - Great budget North Indian and Andhra dishes.",
      "Hotel Vasavi, Rajahmundry - Economical South Indian meals with a homely vibe.",
      "Subbayya Gari Hotel, Kakinada - Authentic Andhra meals at a reasonable price.",
      "Annapurna Tiffins, Kadapa - Affordable breakfast and tiffin options.",
      "Spicy Kitchen, Vijayawada - Low-cost meals with authentic flavors.",
      "RR Dhaba, Vizianagaram - Delicious and budget-friendly Andhra cuisine.",
      "Sri Sai Sagar, Ongole - Pocket-friendly vegetarian dining.",
      "Haritha Hotel, Srisailam - Budget-friendly restaurant with great South Indian food.",
      "Hotel Gowri Sankar, Eluru - Economical dining with a variety of options.",
      "Nandini Tiffins, Anantapur - Popular for cheap and tasty breakfast items.",
      "Shree Krishna Hotel, Nellore - Budget-friendly Andhra meals.",
      "Kinnera Family Restaurant, Kurnool - Affordable meals in a family-friendly setting.",
      "Swagruha Foods, Visakhapatnam - Quick bites and affordable meals."
    ]
  },
  {
    "tag": "premium_dining",
    "patterns": [
       "Find premium dining options",
      "Suggest luxury restaurants in Andhra Pradesh",
      "Where can I find fine dining in Vijayawada?",
      "Luxury restaurants in Visakhapatnam",
      "Fine dining in Guntur",
      "Suggest fine dining in Ongole",
      "Where to find luxury restaurants in Kakinada?",
      "Premium restaurants in Kadapa",
      "High-end dining options in Anantapur",
      "What are some luxurious restaurants in Rajahmundry?",
      "Show me premium dining spots in Nellore",
      "Are there any fine dining options in Eluru?"
    ],
    "responses": [
      "For fine dining, try:\n1. Dolphin Hotel, Visakhapatnam\n2. WelcomCafe, Vijayawada\n3. Taj Gateway Hotel, Vijayawada",
      "Dolphin Hotel, Visakhapatnam - Elegant dining with premium coastal cuisine.",
      "The Gateway Hotel, Vijayawada - Fine dining with a variety of cuisines.",
      "WelcomCafe, Guntur - Luxurious dining with exquisite Andhra dishes.",
      "GreenPark Hotel, Visakhapatnam - Perfect for fine dining with global flavors.",
      "Taj Gateway, Vijayawada - Premium ambiance with authentic Andhra meals.",
      "Sai Priya Beach Resort, Visakhapatnam - Beachside dining with seafood specialties.",
      "Blue Fox, Rajahmundry - Renowned for its continental and Andhra dishes.",
      "Taj Tirupati - Luxury dining experience with diverse options.",
      "Ananda Grand, Kakinada - Fine dining with a mix of traditional and modern cuisine.",
      "Vihari Grand, Nellore - High-end dining with excellent seafood.",
      "Royal Treat, Ongole - Known for its luxurious setting and gourmet meals.",
      "Spice Garden, Kadapa - Perfect for a premium dining experience with local flavors.",
      "Heritage Restaurant, Anantapur - Elegant ambiance with authentic Andhra delicacies.",
      "Paradise Hotel, Eluru - A fine blend of taste and luxury.",
      "Hotel Minerva Grand, Kurnool - Premium dining with traditional Andhra cuisine.",
      "Lotus Restaurant, Ongole - A luxurious experience with diverse gourmet dishes.",
      "Coastal Spice, Kakinada - Exquisite seafood and Andhra specialties in a premium setting.",
      "Galaxy Family Restaurant, Kadapa - Known for its upscale ambiance and delightful meals.",
      "Grand Anantapur, Anantapur - Fine dining with authentic Andhra and North Indian dishes.",
      "River Bay, Rajahmundry - Riverside dining with elegant settings and delicious food."
    ]
  },
  {
    "tag": "special_occasions",
    "patterns": [
      "Suggest restaurants for a romantic dinner",
      "Where can I celebrate a birthday in Andhra Pradesh?",
      "Find restaurants for anniversaries",
      "Show me places for a family gathering",
      "Where to have a formal dinner party?",
      "Best restaurants for weddings in Vijayawada",
      "Luxury dining spots for special events in Visakhapatnam",
      "Where can I host a corporate lunch?",
      "Restaurants with private dining rooms in Guntur",
      "Romantic dinner spots in Nellore",
      "Family-friendly restaurants in Rajahmundry",
      "Show me restaurants for celebrations in Tirupati",
      "Find scenic restaurants for special occasions",
      "Best venues for a get-together in Ongole",
      "Top restaurants for birthday parties in Kakinada"
    ],
    "responses": [
      "For a romantic dinner, try Dolphin Hotel in Visakhapatnam or Taj Gateway in Vijayawada.",
      "For birthdays, Blue Fox in Rajahmundry and Sai Priya Beach Resort in Visakhapatnam are great choices.",
      "For anniversaries, consider Lotus Restaurant in Ongole or Ananda Grand in Kakinada.",
      "For family gatherings, Heritage Restaurant in Anantapur and Paradise Hotel in Eluru are ideal.",
      "For formal dinner parties, GreenPark Hotel in Visakhapatnam or WelcomCafe in Guntur are excellent.",
      "For weddings, River Bay in Rajahmundry offers beautiful settings with great dining.",
      "For corporate lunches, try Hotel Minerva Grand in Kurnool or Taj Tirupati.",
      "For private dining, Royal Treat in Ongole or Galaxy Family Restaurant in Kadapa provide exclusive spaces.",
      "For scenic celebrations, Sai Priya Beach Resort in Visakhapatnam or Coastal Spice in Kakinada are perfect.",
      "For get-togethers, Chaitanya Food Court in Guntur and Roti Restaurant in Visakhapatnam are great choices."
    ]
  },
  {
    "tag": "cuisine_type",
    "patterns": [
      "Where can I find authentic Andhra cuisine?",
      "Suggest some seafood restaurants",
      "I want vegetarian food",
      "Show me some places for biryani",
      "Suggest Chinese restaurants in Vijayawada",
      "What are the best North Indian restaurants in Visakhapatnam?",
      "Find Italian food in Guntur",
      "Are there any good cafes in Tirupati?",
      "Where can I get BBQ in Kurnool?",
      "I need South Indian food options in Rajahmundry",
      "Where to eat traditional food in Ongole?",
      "What are the top bakeries in Nellore?"
    ],
    "responses": [
      "Here are some suggestions based on your request:",
      "Vijayawada:\nSpicy Venue: Famous for Andhra meals\nBBQ Nation: Great for grilled food\nMinerva Grand: Perfect for vegetarian South Indian dishes",
      "Visakhapatnam:\nSea Spice by Chef Mandar: Excellent seafood\nMing Garden: Authentic Chinese cuisine\nZaffran: Specializes in North Indian dishes",
      "Guntur:\nSri Annapurna Restaurant: Authentic Andhra thalis\nAmity Multicuisine: Italian and continental options\nGolden Pavilion: Known for biryani and kebabs",
      "Tirupati: \nBlissful Bites Cafe: Cozy spot for desserts and coffee\nWoodside Restaurant: Renowned for North Indian cuisine\nHotel Minerva: Authentic vegetarian dishes",
      "Kurnool:\nBBQ Avenue: Best for barbecues\nNayaab Biryani House: Famous for biryani\nSpice Hub: Tasty Andhra meals",
      "Rajahmundry:\nAndhra Spice: Traditional Andhra flavors\nRiver Bay: Great for riverside dining\nSesha’s Kitchen: Offers home-style meals",
      "Ongole: \nLasya Grand: Delicious vegetarian options\nReddy’s Dhaba: Rustic charm with authentic food\nBiryani Palace: Known for aromatic biryanis",
      "Nellore:\nBaker’s Cafe: Renowned for pastries and snacks\nCoastal Feast: Amazing seafood options\nSouthern Spice: South Indian cuisine at its best",
      "Here are some authentic Andhra cuisine restaurants in Vijayawada:",
      "Spicy Venue: Known for traditional Andhra meals.",
      "Swagruha Foods: Offers home-style meals and tiffins.",
      "For seafood lovers in Visakhapatnam, try:\nSea Inn: Fresh and delicious coastal seafood.\nBoardwalk: Great for seafood platters with ocean views.",
      "For vegetarian options in Guntur: \nKshetra Veg Restaurant: Delicious vegetarian meals.\nAnnapurna: Popular for pure veg thalis.",
      "If you’re craving biryani in Tirupati:\nParadise Biryani: Renowned for flavorful biryanis.\nNaidu Gari Kunda Biryani: Unique clay pot biryanis.",
      "For Chinese cuisine in Rajahmundry:\nDragon’s Delight: Authentic Chinese dishes.\nChina Town: A mix of Indo-Chinese flavors.",
      "If Italian food is what you seek in Visakhapatnam:\nLittle Italy: Famous for pasta and pizzas.\nRoma Cucina: A cozy spot for authentic Italian cuisine.",
      "For North Indian cuisine in Vijayawada:\nPunjab Grill: Rich and flavorful Punjabi dishes.\nRoti Pe Boti: A perfect spot for tandoori delights.",
      "For continental delights in Kakinada:\nThe Olive Bistro: A fine dining experience.\nContinental Cravings: Great for steaks and grills.",
      "For South Indian food in Nellore:\nMinerva Coffee Shop: Known for South Indian breakfast.\nMurali Krishna Veg Restaurant: Authentic Nellore dishes."
    ]
  }
]
